Revit 2026 API

# RevisionNumberType Enumeration

---

Determines how a particular revision will be numbered.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RevisionNumberType
```
```vb
Public Enumeration RevisionNumberType
```
```cpp
public enum class RevisionNumberType
```
```fsharp
type RevisionNumberType
```

| Member name | Value | Description |
| --- | --- | --- |
| Alphanumeric | 3 | The Revision Number will be a string taken from a user-specified sequence of arbitrary strings. |
| None | 2 | No Revision Number will be assigned. |
| Numeric | 0 | The Revision Number will be a number. |

#### Reference

Autodesk.Revit.DB Namespace